
#include <stdio.h>


/*
60 человек

20 теор
20 анал
20 практ




теор с теор кол-во: 
n * (n - 1) * 7;

анал с анал:
m * (m - 1) * 3;

практ с практ:
k * (k - 1)  * 4;

каждый каждому:
60 * 59 = 60 * 59 = 3540;  

сам себе аналитик:
m * 3

сам себе практ:
k * 4

сам себе теор:
n * 7


//////////
n * (n - 1) * 7 + m * (m - 1) * 3 + k * (k - 1) * 4 + m * 3 + k * 4 + n * 7;

s += 1770;  
*/


int main()
{
	int s, m, n, k;
	int a, b, c;
	int min_;

	s = 0;
	a = 0; //теор
	b = 0; //аналитики
	c = 0; //практики
	min_ = 1000000;
	for (a = 0; a <= 60; ++a) {
		for (b = 0; b <= 60; ++b) {
			for (c = 0; c <= 60; ++c) {
				s = 0;
				if (a + b + c == 60)
				{
					// s = 3 * a * a + 4 * b * b + 7 * c * c + 2 * (a * b + a * c + b * c);
					s = 2 * a * a + 3 * b * b + 6 * c * c;
					if (s < min_)
						min_ = s;
					printf("a = %d, b = %d, c = %d; s = %d\n", a,b,c,s);
				}
			}
		}
	}
	printf("min_ = %d\n", min_);
	printf("min_ = %d\n", min_ + 3600);


	return (0);
}


